# Количество выполненных ДЗ (запишите значение 12)
# Количество затраченных часов (запишите значение 1.5)
# Название курса (запишите значение 'Python')
# Время на одно задание (вычислить используя 1 и 2 переменные)
# Выведите на экран(в консоль), используя переменные, следующую строку:

# Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.

home_task = 12.0
time_use = 1.5
name_course = 'Python'
time_1_task = time_use / home_task
print('Курс: ', name_course, 'всего задач: ', home_task, 'затрачено часов: ', time_use, 'среднее время выполнения', time_1_task ' часа)